Revit 2024 API
BuiltInFailures.DPartFailures.DeletingOriginalWillDeleteParts Property
 Deletion of this element will delete its associated Parts.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DeletingOriginalWillDeleteParts { get; }
Visual Basic
Public Shared ReadOnly Property DeletingOriginalWillDeleteParts As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DeletingOriginalWillDeleteParts {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace